{
  "1": {
    "filename": "hridyesh_resume_1.pdf",
    "rawText": "\n\nHridyesh KumarEmail :  hridyesh2309@gmail.com\nGitHub  LinkedIn  LeetCodeMobile :  +91 81302 52611\nExperience\n•LimeroadGurugram\nSoftware Development InternFebruary 2025 - August 2025\n◦Integrated Vmart storefrontinto the app’s navigation drawer by embedding a secure WebView and refactoring\nsidebar routing (Kotlin—MVVM); identified and cleared every critical defect in the release backlog.\n◦Engineered modern UI components usingJetpack Compose with Material3, implementing interoperability\nbetween Compose and traditional View system while handling runtime permissions (Android13 APIs) and\noptimizing UI performance through properstate managementand background task coordination.\n◦Architectedunidirectional data flowarchitecture (State -¿ Intent -¿ Action -¿ Effect/Event -¿ State) for\nadvanced search functionality implementing clean architecture patterns,achieving 95% search accuracywith\n¡50ms response times through optimized state management and performance optimization.\n◦Designed modular Android architecture implementing clean architecture principles withHilt dependency\ninjection, creatingreusable featuremodules with proper component scoping.\n•College SetuDelhi\nSoftware Development InternMay 2024 - July 2024\n◦Revamped the company’s website using ReactJS and Tailwind CSS and developed a Data Collection Portal with\nFlask, enhancing functionality and user experience.\n◦Implemented comprehensive testing strategies and debugging workflows,optimizing memory managementand\ntroubleshooting performance bottlenecks while collaborating in agile development environment.\nProjects\n•FurniARAR, Android Development, Firebase\nRepository08/2024 - 08/2024\n◦Modular Architecture:  Implemented clean Android architecture usingKotlin with MVVM pattern and Hilt DI\nframework, dependency scoping across feature while achieving 30% performance through memory management\noptimization.\n◦Enterprise Architecture:  Implementedmulti-module architecturewith dependency injection across feature modules,\nmanaging component lifecycles while reducing backend response times by 20% through optimized state management and\nunidirectional data flow patterns.\n•Optimized Neural Network-Based Routing Protocol for VANETsVANET, Machine Learning\nRepository08/2024 - 11/2024\n◦Optimization:  Developed a hybrid routing protocol for VANETs integrating Neural Networks and Reinforcement Learning,\nachieving a 20% reduction in latency and a 15% improvement in routing efficiency.\n◦Adaptability:  Designed and implemented a neural network-driven decision-making system to optimize routing in dynamic\nvehicular networks, demonstrating scalability and adaptability through real-time simulations.\nSkills\n•Android Architecture:  Kotlin, Java, Android SDK, MVVM, Clean Architecture, Modular Design, Dependency\nInjection (Hilt)\n•Mobile Technologies:  Jetpack Compose, Material Design, Performance Optimization, Memory Management, UI/UX\nDesign\n•Development Tools:  Git, JIRA, Android Studio, IntelliJ, GitHub, Performance Profiling, Testing Frameworks\nEducation\n•Netaji Subhas University of TechnologyDelhi\nBachelor of Technology in Mathematics and Computing2025\n◦Relevant Coursework:  Data Structures, Design and Analysis of Algorithms, Machine Learning, Software\nEngineering, Soft Computing, Computer Networks, Operating Systems, Scientific Computing, Theory of Automata,\nOptimization, Mathematical Statistics, Database Management System, Computer Architecture, Big Data Analytics\nAchievements\n•Authored a23-page research paperon improving Grover’s algorithm for quantum search optimization, leveraging\nIBM’s Quantum Experience toolset for simulation and testing.  Delivered 3+ on-campus presentations to faculty.\n•Co-authored a13-page journal articleon a hybrid VANET routing protocol using ANN and Reinforcement\nLearning, achieving improved PDR, latency, and throughput through multimetric optimization and simulations.",
    "cleanedData": {
      "education": "Bachelor of Technology in Mathematics and Computing from Netaji Subhas University of Technology (2025)",
      "experience": "Software Development Intern at Limeroad (Feb 2025 - Aug 2025) and College Setu (May 2024 - July 2024)",
      "skills": "Java, Kotlin, React, React Native, Node.js, TypeScript, SQL, JavaScript, HTML, CSS, Material Design, Android SDK, Git, GitHub, Docker",
      "projects": "FurniAR (AR furniture app), Neural Network Routing for VANETs, Email Oasis, Poem Generator, Quantum Computing project",
      "achievements": "Authored 23-page research paper on Grover's algorithm, Co-authored 13-page journal article on VANET routing protocol",
      "fullText": "Hridyesh KumarEmail : hridyesh2309@gmail.com Git Hub Linked In Leet CodeMobile : +91 81302 52611 Experience \n• Limeroad Gurugram Software Development Intern February 2025 - August 2025 \n• Integrated Vmart storefrontinto the app’s navigation drawer by embedding a secure Web View and refactoring sidebar routing (Kotlin—MVVM); identified and cleared every critical defect in the release backlog. \n• Engineered modern UI components usingJetpack Compose with Material3, implementing interoperability between Compose and traditional View system while handling runtime permissions (Android13 APIs) and optimizing UI performance through properstate managementand background task coordination. \n• Architectedunidirectional data flowarchitecture (State -¿ Intent -¿ Action -¿ Effect/Event -¿ State) for advanced search functionality implementing clean architecture patterns,achieving 95% search accuracywith ¡50ms response times through optimized state management and performance optimization. \n• Designed modular Android architecture implementing clean architecture principles withHilt dependency injection, creatingreusable featuremodules with proper component scoping. \n• College SetuDelhi Software Development InternMay 2024 - July 2024 \n• Revamped the company’s website using ReactJS and Tailwind CSS and developed a Data Collection Portal with Flask, enhancing functionality and user experience. \n• Implemented comprehensive testing strategies and debugging workflows,optimizing memory managementand troubleshooting performance bottlenecks while collaborating in agile development environment. Projects \n• FurniARAR, Android Development, Firebase Repository08/2024 - 08/2024 \n• Modular Architecture: Implemented clean Android architecture usingKotlin with MVVM pattern and Hilt DI framework, dependency scoping across feature while achieving 30% performance through memory management optimization. \n• Enterprise Architecture: Implementedmulti-module architecturewith dependency injection across feature modules, managing component lifecycles while reducing backend response times by 20% through optimized state management and unidirectional data flow patterns. \n• Optimized Neural Network-Based Routing Protocol for VANETsVANET, Machine Learning Repository08/2024 - 11/2024 \n• Optimization: Developed a hybrid routing protocol for VANETs integrating Neural Networks and Reinforcement Learning, achieving a 20% reduction in latency and a 15% improvement in routing efficiency. \n• Adaptability: Designed and implemented a neural network-driven decision-making system to optimize routing in dynamic vehicular networks, demonstrating scalability and adaptability through real-time simulations. Skills \n• Android Architecture: Kotlin, Java, Android SDK, MVVM, Clean Architecture, Modular Design, Dependency Injection (Hilt) \n• Mobile Technologies: Jetpack Compose, Material Design, Performance Optimization, Memory Management, UI/UX Design \n• Development Tools: Git, JIRA, Android Studio, IntelliJ, Git Hub, Performance Profiling, Testing Frameworks Education \n• Netaji Subhas University of Technology Delhi Bachelor of Technology in Mathematics and Computing2025 \n• Relevant Coursework: Data Structures, Design and Analysis of Algorithms, Machine Learning, Software Engineering, Soft Computing, Computer Networks, Operating Systems, Scientific Computing, Theory of Automata, Optimization, Mathematical Statistics, Database Management System, Computer Architecture, Big Data Analytics Achievements \n• Authored a23-page research paperon improving Grover’s algorithm for quantum search optimization, leveraging IBM’s Quantum Experience toolset for simulation and testing. Delivered 3+ on-campus presentations to faculty. \n• Co-authored a13-page journal articleon a hybrid VANET routing protocol using ANN and Reinforcement Learning, achieving improved PDR, latency, and throughput through multimetric optimization and simulations."
    },
    "formattedData": "\n1 RESUME CONTENT:\n\nEDUCATION:\nBachelor of Technology in Mathematics and Computing from Netaji Subhas University of Technology (2025)\n\nEXPERIENCE:\nSoftware Development Intern at Limeroad (Feb 2025 - Aug 2025) and College Setu (May 2024 - July 2024)\n\nSKILLS:\nJava, Kotlin, React, React Native, Node.js, TypeScript, SQL, JavaScript, HTML, CSS, Material Design, Android SDK, Git, GitHub, Docker\n\nPROJECTS:\nFurniAR (AR furniture app), Neural Network Routing for VANETs, Email Oasis, Poem Generator, Quantum Computing project\n\nACHIEVEMENTS:\nAuthored 23-page research paper on Grover's algorithm, Co-authored 13-page journal article on VANET routing protocol\n\nCONTACT INFORMATION:\n- Email: hridyesh2309@gmail.com\n- GitHub: github.com/hridyeshh\n- LinkedIn: linkedin.com/in/hridyeshh\n- LeetCode: leetcode.com/hridyeshh\n- Mobile: +91 81302 52611\n\nKEY METRICS & ACHIEVEMENTS:\n- 95% search accuracy with <50ms response times at Limeroad\n- 50k+ users served with optimized payment processing workflows\n- 30% screen transition speed improvement in FurniAR app\n- 20% backend response time reduction through database optimization\n- 20% latency reduction and 15% efficiency improvement in VANET routing\n- 23-page research paper on quantum computing optimization\n- 13-page journal article on hybrid VANET routing protocol\n- 3+ on-campus presentations to faculty\n\nTECHNICAL EXPERTISE:\n- Mobile Development: Kotlin, Java, Android SDK, Material Design, MVVM, ARCore\n- Web Development: React, React Native, TypeScript, JavaScript, HTML/CSS\n- Backend Development: Node.js, Python, Flask, SQL, RESTful APIs\n- Machine Learning: Neural Networks, Reinforcement Learning, Python\n- Developer Tools: Git, GitHub, Docker, Android Studio, IntelliJ, PyCharm\n- Research: Quantum Computing, VANET routing, Algorithm optimization\n"
  },
  "Hridyesh_resume": {
    "filename": "hridyesh_resume.pdf",
    "rawText": "\n\nHridyesh KumarEmail :  hridyesh2309@gmail.com\nGitHub  LinkedIn  LeetCodeMobile :  +91 81302 52611\nExperience\n•LimeroadGurugram\nSoftware Development InternFebruary 2025 - August 2025\n◦Integrated Vmart storefrontinto the app’s navigation drawer by embedding a secure WebView and refactoring\nsidebar routing (Kotlin—MVVM); identified and cleared every critical defect in the release backlog.\n◦Developed backend services and RESTful APIs using Java for payment processing workflows, implementing\nobject-oriented design patterns and optimizing database queries for high-performance transaction handling serving\n50k+ users.\n◦Engineered a modern “AddAddress” screen from scratch with Material3, implementing granular runtime\nlocation-permission handling(Android13 APIs) and Google FusedLocation Provider; cut checkout address-entry\ntime and user drop-offs, while boosting Lighthouse accessibility and performance scores.\n◦ArchitectedRESTful web servicesfor advanced search functionality integrating backend APIs withJava-based\nmicroservices, achieving 95% search accuracy with ¡50ms response times and implementing multithreaded\nprocessing to reduce payment friction during checkout workflows.\n•College SetuDelhi\nSoftware Development InternMay 2024 - July 2024\n◦Developed Data Collection Portal with database design usingSQL and Flask framework, implementing RESTful\nweb services and optimizing database schema for efficient data retrieval and storage operations.\n◦Demonstrated strong teamwork, adaptability, and a commitment to delivering high-quality outcomes in a fast-paced\ndevelopment environment.\nProjects\n•FurniARAR, Android Development, Firebase\nRepository08/2024 - 08/2024\n◦Responsiveness:  Developed an AR-based furniture visualization app usingKotlin, Sceneform (ARCore), MVVM, and\nHilt, enhanced user experience by optimizing screen transition speed by 30%\n◦Database Optimization::  Designed and implemented database schema withSQL optimization techniques, reducing\nbackend response times by 20% andintegrating RESTful servicesfor scalable data processing and transaction handling\n•Optimized Neural Network-Based Routing Protocol for VANETsVANET, Machine Learning\nRepository08/2024 - 11/2024\n◦Optimization:  Developed a hybrid routing protocol for VANETs integrating Neural Networks and Reinforcement Learning,\nachieving a 20% reduction in latency and a 15% improvement in routing efficiency.\n◦Adaptability:  Designed and implemented a neural network-driven decision-making system to optimize routing in dynamic\nvehicular networks, demonstrating scalability and adaptability through real-time simulations.\nSkills\n•Languages and Development tools:  Java, Kotlin, React, React Native, Node.js, TypeScript, SQL, JavaScript,\nHTML, CSS\n•Frameworks:  Material Design, Android SDK, OkHttp, Gson Arch-components, Tailwind CSS, React Hooks\n•Developer Tools:  Git, GitHub, Docker, PyCharm, Jupyter Notebook, IntelliJ, Android Studio, Cursor, AI prompts\nEducation\n•Netaji Subhas University of TechnologyDelhi\nBachelor of Technology in Mathematics and Computing2025\n◦Relevant Coursework:  Data Structures, Design and Analysis of Algorithms, Machine Learning, Software\nEngineering, Soft Computing, Computer Networks, Operating Systems, Scientific Computing, Theory of Automata,\nOptimization, Mathematical Statistics, Database Management System, Computer Architecture, Big Data Analytics\nAchievements\n•Authored a23-page research paperon improving Grover’s algorithm for quantum search optimization, leveraging\nIBM’s Quantum Experience toolset for simulation and testing.  Delivered 3+ on-campus presentations to faculty.\n•Co-authored a13-page journal articleon a hybrid VANET routing protocol using ANN and Reinforcement\nLearning, achieving improved PDR, latency, and throughput through multimetric optimization and simulations.",
    "cleanedData": {
      "education": "Bachelor of Technology in Mathematics and Computing from Netaji Subhas University of Technology (2025)",
      "experience": "Software Development Intern at Limeroad (Feb 2025 - Aug 2025) and College Setu (May 2024 - July 2024)",
      "skills": "Java, Kotlin, React, React Native, Node.js, TypeScript, SQL, JavaScript, HTML, CSS, Material Design, Android SDK, Git, GitHub, Docker",
      "projects": "FurniAR (AR furniture app), Neural Network Routing for VANETs, Email Oasis, Poem Generator, Quantum Computing project",
      "achievements": "Authored 23-page research paper on Grover's algorithm, Co-authored 13-page journal article on VANET routing protocol",
      "fullText": "Hridyesh KumarEmail : hridyesh2309@gmail.com Git Hub Linked In Leet CodeMobile : +91 81302 52611 Experience \n• Limeroad Gurugram Software Development Intern February 2025 - August 2025 \n• Integrated Vmart storefrontinto the app’s navigation drawer by embedding a secure Web View and refactoring sidebar routing (Kotlin—MVVM); identified and cleared every critical defect in the release backlog. \n• Developed backend services and RESTful APIs using Java for payment processing workflows, implementing object-oriented design patterns and optimizing database queries for high-performance transaction handling serving 50k+ users. \n• Engineered a modern “Add Address” screen from scratch with Material3, implementing granular runtime location-permission handling(Android13 APIs) and Google FusedLocation Provider; cut checkout address-entry time and user drop-offs, while boosting Lighthouse accessibility and performance scores. \n• ArchitectedRESTful web servicesfor advanced search functionality integrating backend APIs withJava-based microservices, achieving 95% search accuracy with ¡50ms response times and implementing multithreaded processing to reduce payment friction during checkout workflows. \n• College SetuDelhi Software Development InternMay 2024 - July 2024 \n• Developed Data Collection Portal with database design usingSQL and Flask framework, implementing RESTful web services and optimizing database schema for efficient data retrieval and storage operations. \n• Demonstrated strong teamwork, adaptability, and a commitment to delivering high-quality outcomes in a fast-paced development environment. Projects \n• FurniARAR, Android Development, Firebase Repository08/2024 - 08/2024 \n• Responsiveness: Developed an AR-based furniture visualization app usingKotlin, Sceneform (ARCore), MVVM, and Hilt, enhanced user experience by optimizing screen transition speed by 30% \n• Database Optimization:: Designed and implemented database schema withSQL optimization techniques, reducing backend response times by 20% andintegrating RESTful servicesfor scalable data processing and transaction handling \n• Optimized Neural Network-Based Routing Protocol for VANETsVANET, Machine Learning Repository08/2024 - 11/2024 \n• Optimization: Developed a hybrid routing protocol for VANETs integrating Neural Networks and Reinforcement Learning, achieving a 20% reduction in latency and a 15% improvement in routing efficiency. \n• Adaptability: Designed and implemented a neural network-driven decision-making system to optimize routing in dynamic vehicular networks, demonstrating scalability and adaptability through real-time simulations. Skills \n• Languages and Development tools: Java, Kotlin, React, React Native, Node.js, Type Script, SQL, Java Script, HTML, CSS \n• Frameworks: Material Design, Android SDK, Ok Http, Gson Arch-components, Tailwind CSS, React Hooks \n• Developer Tools: Git, Git Hub, Docker, Py Charm, Jupyter Notebook, IntelliJ, Android Studio, Cursor, AI prompts Education \n• Netaji Subhas University of Technology Delhi Bachelor of Technology in Mathematics and Computing2025 \n• Relevant Coursework: Data Structures, Design and Analysis of Algorithms, Machine Learning, Software Engineering, Soft Computing, Computer Networks, Operating Systems, Scientific Computing, Theory of Automata, Optimization, Mathematical Statistics, Database Management System, Computer Architecture, Big Data Analytics Achievements \n• Authored a23-page research paperon improving Grover’s algorithm for quantum search optimization, leveraging IBM’s Quantum Experience toolset for simulation and testing. Delivered 3+ on-campus presentations to faculty. \n• Co-authored a13-page journal articleon a hybrid VANET routing protocol using ANN and Reinforcement Learning, achieving improved PDR, latency, and throughput through multimetric optimization and simulations."
    },
    "formattedData": "\nHRIDYESH_RESUME RESUME CONTENT:\n\nEDUCATION:\nBachelor of Technology in Mathematics and Computing from Netaji Subhas University of Technology (2025)\n\nEXPERIENCE:\nSoftware Development Intern at Limeroad (Feb 2025 - Aug 2025) and College Setu (May 2024 - July 2024)\n\nSKILLS:\nJava, Kotlin, React, React Native, Node.js, TypeScript, SQL, JavaScript, HTML, CSS, Material Design, Android SDK, Git, GitHub, Docker\n\nPROJECTS:\nFurniAR (AR furniture app), Neural Network Routing for VANETs, Email Oasis, Poem Generator, Quantum Computing project\n\nACHIEVEMENTS:\nAuthored 23-page research paper on Grover's algorithm, Co-authored 13-page journal article on VANET routing protocol\n\nCONTACT INFORMATION:\n- Email: hridyesh2309@gmail.com\n- GitHub: github.com/hridyeshh\n- LinkedIn: linkedin.com/in/hridyeshh\n- LeetCode: leetcode.com/hridyeshh\n- Mobile: +91 81302 52611\n\nKEY METRICS & ACHIEVEMENTS:\n- 95% search accuracy with <50ms response times at Limeroad\n- 50k+ users served with optimized payment processing workflows\n- 30% screen transition speed improvement in FurniAR app\n- 20% backend response time reduction through database optimization\n- 20% latency reduction and 15% efficiency improvement in VANET routing\n- 23-page research paper on quantum computing optimization\n- 13-page journal article on hybrid VANET routing protocol\n- 3+ on-campus presentations to faculty\n\nTECHNICAL EXPERTISE:\n- Mobile Development: Kotlin, Java, Android SDK, Material Design, MVVM, ARCore\n- Web Development: React, React Native, TypeScript, JavaScript, HTML/CSS\n- Backend Development: Node.js, Python, Flask, SQL, RESTful APIs\n- Machine Learning: Neural Networks, Reinforcement Learning, Python\n- Developer Tools: Git, GitHub, Docker, Android Studio, IntelliJ, PyCharm\n- Research: Quantum Computing, VANET routing, Algorithm optimization\n"
  },
  "IBM": {
    "filename": "hridyesh_resume_IBM.pdf",
    "rawText": "\n\nHridyesh KumarEmail :  hridyesh2309@gmail.com\nGitHub  LinkedIn  LeetCodeMobile :  +91 81302 52611\nExperience\n•LimeroadGurugram\nSoftware Development InternFebruary 2025 - August 2025\n◦Integrated Vmart storefrontinto the app’s navigation drawer by embedding a secure WebView and refactoring\nsidebar routing (Kotlin—MVVM); identified and cleared every critical defect in the release backlog.\n◦Engineered modern UI components usingJetpack Compose with Material3, implementing interoperability\nbetween Compose and traditional View system while handling runtime permissions (Android13 APIs) and\noptimizing UI performance through properstate managementand background task coordination.\n◦Architectedunidirectional data flowarchitecture (State -¿ Intent -¿ Action -¿ Effect/Event -¿ State) for\nadvanced search functionality implementing clean architecture patterns,achieving 95% search accuracywith\n¡50ms response times through optimized state management and performance optimization.\n◦Designed modular Android architecture implementing clean architecture principles withHilt dependency\ninjection, creatingreusable featuremodules with proper component scoping.\n•College SetuDelhi\nSoftware Development InternMay 2024 - July 2024\n◦Revamped the company’s website using ReactJS and Tailwind CSS and developed a Data Collection Portal with\nFlask, enhancing functionality and user experience.\n◦Implemented comprehensive testing strategies and debugging workflows,optimizing memory managementand\ntroubleshooting performance bottlenecks while collaborating in agile development environment.\nProjects\n•FurniARAR, Android Development, Firebase\nRepository08/2024 - 08/2024\n◦Modular Architecture:  Implemented clean Android architecture usingKotlin with MVVM pattern and Hilt DI\nframework, dependency scoping across feature while achieving 30% performance through memory management\noptimization.\n◦Enterprise Architecture:  Implementedmulti-module architecturewith dependency injection across feature modules,\nmanaging component lifecycles while reducing backend response times by 20% through optimized state management and\nunidirectional data flow patterns.\n•Optimized Neural Network-Based Routing Protocol for VANETsVANET, Machine Learning\nRepository08/2024 - 11/2024\n◦Optimization:  Developed a hybrid routing protocol for VANETs integrating Neural Networks and Reinforcement Learning,\nachieving a 20% reduction in latency and a 15% improvement in routing efficiency.\n◦Adaptability:  Designed and implemented a neural network-driven decision-making system to optimize routing in dynamic\nvehicular networks, demonstrating scalability and adaptability through real-time simulations.\nSkills\n•Android Architecture:  Kotlin, Java, Android SDK, MVVM, Clean Architecture, Modular Design, Dependency\nInjection (Hilt)\n•Mobile Technologies:  Jetpack Compose, Material Design, Performance Optimization, Memory Management, UI/UX\nDesign\n•Development Tools:  Git, JIRA, Android Studio, IntelliJ, GitHub, Performance Profiling, Testing Frameworks\nEducation\n•Netaji Subhas University of TechnologyDelhi\nBachelor of Technology in Mathematics and Computing2025\n◦Relevant Coursework:  Data Structures, Design and Analysis of Algorithms, Machine Learning, Software\nEngineering, Soft Computing, Computer Networks, Operating Systems, Scientific Computing, Theory of Automata,\nOptimization, Mathematical Statistics, Database Management System, Computer Architecture, Big Data Analytics\nAchievements\n•Authored a23-page research paperon improving Grover’s algorithm for quantum search optimization, leveraging\nIBM’s Quantum Experience toolset for simulation and testing.  Delivered 3+ on-campus presentations to faculty.\n•Co-authored a13-page journal articleon a hybrid VANET routing protocol using ANN and Reinforcement\nLearning, achieving improved PDR, latency, and throughput through multimetric optimization and simulations.",
    "cleanedData": {
      "education": "Bachelor of Technology in Mathematics and Computing from Netaji Subhas University of Technology (2025)",
      "experience": "Software Development Intern at Limeroad (Feb 2025 - Aug 2025) and College Setu (May 2024 - July 2024)",
      "skills": "Java, Kotlin, React, React Native, Node.js, TypeScript, SQL, JavaScript, HTML, CSS, Material Design, Android SDK, Git, GitHub, Docker",
      "projects": "FurniAR (AR furniture app), Neural Network Routing for VANETs, Email Oasis, Poem Generator, Quantum Computing project",
      "achievements": "Authored 23-page research paper on Grover's algorithm, Co-authored 13-page journal article on VANET routing protocol",
      "fullText": "Hridyesh KumarEmail : hridyesh2309@gmail.com Git Hub Linked In Leet CodeMobile : +91 81302 52611 Experience \n• Limeroad Gurugram Software Development Intern February 2025 - August 2025 \n• Integrated Vmart storefrontinto the app’s navigation drawer by embedding a secure Web View and refactoring sidebar routing (Kotlin—MVVM); identified and cleared every critical defect in the release backlog. \n• Engineered modern UI components usingJetpack Compose with Material3, implementing interoperability between Compose and traditional View system while handling runtime permissions (Android13 APIs) and optimizing UI performance through properstate managementand background task coordination. \n• Architectedunidirectional data flowarchitecture (State -¿ Intent -¿ Action -¿ Effect/Event -¿ State) for advanced search functionality implementing clean architecture patterns,achieving 95% search accuracywith ¡50ms response times through optimized state management and performance optimization. \n• Designed modular Android architecture implementing clean architecture principles withHilt dependency injection, creatingreusable featuremodules with proper component scoping. \n• College SetuDelhi Software Development InternMay 2024 - July 2024 \n• Revamped the company’s website using ReactJS and Tailwind CSS and developed a Data Collection Portal with Flask, enhancing functionality and user experience. \n• Implemented comprehensive testing strategies and debugging workflows,optimizing memory managementand troubleshooting performance bottlenecks while collaborating in agile development environment. Projects \n• FurniARAR, Android Development, Firebase Repository08/2024 - 08/2024 \n• Modular Architecture: Implemented clean Android architecture usingKotlin with MVVM pattern and Hilt DI framework, dependency scoping across feature while achieving 30% performance through memory management optimization. \n• Enterprise Architecture: Implementedmulti-module architecturewith dependency injection across feature modules, managing component lifecycles while reducing backend response times by 20% through optimized state management and unidirectional data flow patterns. \n• Optimized Neural Network-Based Routing Protocol for VANETsVANET, Machine Learning Repository08/2024 - 11/2024 \n• Optimization: Developed a hybrid routing protocol for VANETs integrating Neural Networks and Reinforcement Learning, achieving a 20% reduction in latency and a 15% improvement in routing efficiency. \n• Adaptability: Designed and implemented a neural network-driven decision-making system to optimize routing in dynamic vehicular networks, demonstrating scalability and adaptability through real-time simulations. Skills \n• Android Architecture: Kotlin, Java, Android SDK, MVVM, Clean Architecture, Modular Design, Dependency Injection (Hilt) \n• Mobile Technologies: Jetpack Compose, Material Design, Performance Optimization, Memory Management, UI/UX Design \n• Development Tools: Git, JIRA, Android Studio, IntelliJ, Git Hub, Performance Profiling, Testing Frameworks Education \n• Netaji Subhas University of Technology Delhi Bachelor of Technology in Mathematics and Computing2025 \n• Relevant Coursework: Data Structures, Design and Analysis of Algorithms, Machine Learning, Software Engineering, Soft Computing, Computer Networks, Operating Systems, Scientific Computing, Theory of Automata, Optimization, Mathematical Statistics, Database Management System, Computer Architecture, Big Data Analytics Achievements \n• Authored a23-page research paperon improving Grover’s algorithm for quantum search optimization, leveraging IBM’s Quantum Experience toolset for simulation and testing. Delivered 3+ on-campus presentations to faculty. \n• Co-authored a13-page journal articleon a hybrid VANET routing protocol using ANN and Reinforcement Learning, achieving improved PDR, latency, and throughput through multimetric optimization and simulations."
    },
    "formattedData": "\nIBM RESUME CONTENT:\n\nEDUCATION:\nBachelor of Technology in Mathematics and Computing from Netaji Subhas University of Technology (2025)\n\nEXPERIENCE:\nSoftware Development Intern at Limeroad (Feb 2025 - Aug 2025) and College Setu (May 2024 - July 2024)\n\nSKILLS:\nJava, Kotlin, React, React Native, Node.js, TypeScript, SQL, JavaScript, HTML, CSS, Material Design, Android SDK, Git, GitHub, Docker\n\nPROJECTS:\nFurniAR (AR furniture app), Neural Network Routing for VANETs, Email Oasis, Poem Generator, Quantum Computing project\n\nACHIEVEMENTS:\nAuthored 23-page research paper on Grover's algorithm, Co-authored 13-page journal article on VANET routing protocol\n\nCONTACT INFORMATION:\n- Email: hridyesh2309@gmail.com\n- GitHub: github.com/hridyeshh\n- LinkedIn: linkedin.com/in/hridyeshh\n- LeetCode: leetcode.com/hridyeshh\n- Mobile: +91 81302 52611\n\nKEY METRICS & ACHIEVEMENTS:\n- 95% search accuracy with <50ms response times at Limeroad\n- 50k+ users served with optimized payment processing workflows\n- 30% screen transition speed improvement in FurniAR app\n- 20% backend response time reduction through database optimization\n- 20% latency reduction and 15% efficiency improvement in VANET routing\n- 23-page research paper on quantum computing optimization\n- 13-page journal article on hybrid VANET routing protocol\n- 3+ on-campus presentations to faculty\n\nTECHNICAL EXPERTISE:\n- Mobile Development: Kotlin, Java, Android SDK, Material Design, MVVM, ARCore\n- Web Development: React, React Native, TypeScript, JavaScript, HTML/CSS\n- Backend Development: Node.js, Python, Flask, SQL, RESTful APIs\n- Machine Learning: Neural Networks, Reinforcement Learning, Python\n- Developer Tools: Git, GitHub, Docker, Android Studio, IntelliJ, PyCharm\n- Research: Quantum Computing, VANET routing, Algorithm optimization\n"
  },
  "LJI": {
    "filename": "hridyesh_resume_LJI.pdf",
    "rawText": "\n\nHridyesh KumarEmail :  hridyesh2309@gmail.com\nGitHub  LinkedIn  LeetCodeMobile :  +91 81302 52611\nExperience\n•LimeroadGurugram\nSoftware Development InternFebruary 2025 - August 2025\n◦Integrated Vmart storefrontinto the app’s navigation drawer by embedding a secure WebView and refactoring\nsidebar routing (Kotlin—MVVM); identified and cleared every critical defect in the release backlog.\n◦Engineered System UI components usingJetpack Compose with Material3, implementing interoperability\nbetween Compose and traditional View system while debugging performance issues andoptimizing UI rendering\nthrough proper state management, creating developer-friendly APIs and documentation for team adoption.\n◦Architected developer-friendly System UI APIs implementingunidirectional data flow patterns, creating\nreusable components and best practice guidelines that enable other developers to achieve 95% search accuracy with\n¡50ms response times, demonstrating expertise in building tools that enhance developer productivity across teams.\n◦Designed modular Android architecture implementing clean architecture principles withHilt dependency\ninjection, creatingreusable featuremodules with proper component scoping.\n•College SetuDelhi\nSoftware Development InternMay 2024 - July 2024\n◦Revamped the company’s website using ReactJS and Tailwind CSS and developed a Data Collection Portal with\nFlask, enhancing functionality and user experience.\n◦Implemented comprehensive testing strategies and debugging workflows,optimizing memory managementand\ntroubleshooting performance bottlenecks while collaborating in agile development environment.\nProjects\n•FurniARAR, Android Development, Firebase\nRepository08/2024 - 08/2024\n◦Modular Architecture:  Implemented clean Android architecture usingKotlin with MVVM pattern and Hilt DI\nframework, creatingopen-source-ready component librariesand technical documentation that improved developer\nonboarding andachieved 30% performance improvementthrough memory management optimization.\n◦Enterprise Architecture:  Implementedmulti-module architecturewith dependency injection across feature modules,\nmanaging component lifecycles while reducing backend response times by 20% through optimized state management and\nunidirectional data flow patterns.\n•Optimized Neural Network-Based Routing Protocol for VANETsVANET, Machine Learning\nRepository08/2024 - 11/2024\n◦Optimization:  Developed a hybrid routing protocol for VANETs integrating Neural Networks and Reinforcement Learning,\nachieving a 20% reduction in latency and a 15% improvement in routing efficiency.\n◦Adaptability:  Designed and implemented a neural network-driven decision-making system to optimize routing in dynamic\nvehicular networks, demonstrating scalability and adaptability through real-time simulations.\nSkills\n•Android Architecture:  Kotlin, Java, Android SDK, MVVM, Clean Architecture, Modular Design, Dependency\nInjection (Hilt)\n•Mobile Technologies:  Jetpack Compose, Material Design, Performance Optimization, Memory Management, UI/UX\nDesign\n•Developer Relations:  System UI APIs, Technical Documentation, Community Engagement, API Design\nEducation\n•Netaji Subhas University of TechnologyDelhi\nBachelor of Technology in Mathematics and Computing2025\n◦Relevant Coursework:  Data Structures, Design and Analysis of Algorithms, Machine Learning, Software\nEngineering, Soft Computing, Computer Networks, Operating Systems, Scientific Computing, Theory of Automata,\nOptimization, Mathematical Statistics, Database Management System, Computer Architecture, Big Data Analytics\nAchievements\n•Authored a23-page research paperon improving Grover’s algorithm for quantum search optimization, leveraging\nIBM’s Quantum Experience toolset for simulation and testing.  Delivered 3+ on-campus presentations to faculty.\n•Co-authored a13-page journal articleon a hybrid VANET routing protocol using ANN and Reinforcement\nLearning, achieving improved PDR, latency, and throughput through multimetric optimization and simulations.",
    "cleanedData": {
      "education": "Bachelor of Technology in Mathematics and Computing from Netaji Subhas University of Technology (2025)",
      "experience": "Software Development Intern at Limeroad (Feb 2025 - Aug 2025) and College Setu (May 2024 - July 2024)",
      "skills": "Java, Kotlin, React, React Native, Node.js, TypeScript, SQL, JavaScript, HTML, CSS, Material Design, Android SDK, Git, GitHub, Docker",
      "projects": "FurniAR (AR furniture app), Neural Network Routing for VANETs, Email Oasis, Poem Generator, Quantum Computing project",
      "achievements": "Authored 23-page research paper on Grover's algorithm, Co-authored 13-page journal article on VANET routing protocol",
      "fullText": "Hridyesh KumarEmail : hridyesh2309@gmail.com Git Hub Linked In Leet CodeMobile : +91 81302 52611 Experience \n• Limeroad Gurugram Software Development Intern February 2025 - August 2025 \n• Integrated Vmart storefrontinto the app’s navigation drawer by embedding a secure Web View and refactoring sidebar routing (Kotlin—MVVM); identified and cleared every critical defect in the release backlog. \n• Engineered System UI components usingJetpack Compose with Material3, implementing interoperability between Compose and traditional View system while debugging performance issues andoptimizing UI rendering through proper state management, creating developer-friendly APIs and documentation for team adoption. \n• Architected developer-friendly System UI APIs implementingunidirectional data flow patterns, creating reusable components and best practice guidelines that enable other developers to achieve 95% search accuracy with ¡50ms response times, demonstrating expertise in building tools that enhance developer productivity across teams. \n• Designed modular Android architecture implementing clean architecture principles withHilt dependency injection, creatingreusable featuremodules with proper component scoping. \n• College SetuDelhi Software Development InternMay 2024 - July 2024 \n• Revamped the company’s website using ReactJS and Tailwind CSS and developed a Data Collection Portal with Flask, enhancing functionality and user experience. \n• Implemented comprehensive testing strategies and debugging workflows,optimizing memory managementand troubleshooting performance bottlenecks while collaborating in agile development environment. Projects \n• FurniARAR, Android Development, Firebase Repository08/2024 - 08/2024 \n• Modular Architecture: Implemented clean Android architecture usingKotlin with MVVM pattern and Hilt DI framework, creatingopen-source-ready component librariesand technical documentation that improved developer onboarding andachieved 30% performance improvementthrough memory management optimization. \n• Enterprise Architecture: Implementedmulti-module architecturewith dependency injection across feature modules, managing component lifecycles while reducing backend response times by 20% through optimized state management and unidirectional data flow patterns. \n• Optimized Neural Network-Based Routing Protocol for VANETsVANET, Machine Learning Repository08/2024 - 11/2024 \n• Optimization: Developed a hybrid routing protocol for VANETs integrating Neural Networks and Reinforcement Learning, achieving a 20% reduction in latency and a 15% improvement in routing efficiency. \n• Adaptability: Designed and implemented a neural network-driven decision-making system to optimize routing in dynamic vehicular networks, demonstrating scalability and adaptability through real-time simulations. Skills \n• Android Architecture: Kotlin, Java, Android SDK, MVVM, Clean Architecture, Modular Design, Dependency Injection (Hilt) \n• Mobile Technologies: Jetpack Compose, Material Design, Performance Optimization, Memory Management, UI/UX Design \n• Developer Relations: System UI APIs, Technical Documentation, Community Engagement, API Design Education \n• Netaji Subhas University of Technology Delhi Bachelor of Technology in Mathematics and Computing2025 \n• Relevant Coursework: Data Structures, Design and Analysis of Algorithms, Machine Learning, Software Engineering, Soft Computing, Computer Networks, Operating Systems, Scientific Computing, Theory of Automata, Optimization, Mathematical Statistics, Database Management System, Computer Architecture, Big Data Analytics Achievements \n• Authored a23-page research paperon improving Grover’s algorithm for quantum search optimization, leveraging IBM’s Quantum Experience toolset for simulation and testing. Delivered 3+ on-campus presentations to faculty. \n• Co-authored a13-page journal articleon a hybrid VANET routing protocol using ANN and Reinforcement Learning, achieving improved PDR, latency, and throughput through multimetric optimization and simulations."
    },
    "formattedData": "\nLJI RESUME CONTENT:\n\nEDUCATION:\nBachelor of Technology in Mathematics and Computing from Netaji Subhas University of Technology (2025)\n\nEXPERIENCE:\nSoftware Development Intern at Limeroad (Feb 2025 - Aug 2025) and College Setu (May 2024 - July 2024)\n\nSKILLS:\nJava, Kotlin, React, React Native, Node.js, TypeScript, SQL, JavaScript, HTML, CSS, Material Design, Android SDK, Git, GitHub, Docker\n\nPROJECTS:\nFurniAR (AR furniture app), Neural Network Routing for VANETs, Email Oasis, Poem Generator, Quantum Computing project\n\nACHIEVEMENTS:\nAuthored 23-page research paper on Grover's algorithm, Co-authored 13-page journal article on VANET routing protocol\n\nCONTACT INFORMATION:\n- Email: hridyesh2309@gmail.com\n- GitHub: github.com/hridyeshh\n- LinkedIn: linkedin.com/in/hridyeshh\n- LeetCode: leetcode.com/hridyeshh\n- Mobile: +91 81302 52611\n\nKEY METRICS & ACHIEVEMENTS:\n- 95% search accuracy with <50ms response times at Limeroad\n- 50k+ users served with optimized payment processing workflows\n- 30% screen transition speed improvement in FurniAR app\n- 20% backend response time reduction through database optimization\n- 20% latency reduction and 15% efficiency improvement in VANET routing\n- 23-page research paper on quantum computing optimization\n- 13-page journal article on hybrid VANET routing protocol\n- 3+ on-campus presentations to faculty\n\nTECHNICAL EXPERTISE:\n- Mobile Development: Kotlin, Java, Android SDK, Material Design, MVVM, ARCore\n- Web Development: React, React Native, TypeScript, JavaScript, HTML/CSS\n- Backend Development: Node.js, Python, Flask, SQL, RESTful APIs\n- Machine Learning: Neural Networks, Reinforcement Learning, Python\n- Developer Tools: Git, GitHub, Docker, Android Studio, IntelliJ, PyCharm\n- Research: Quantum Computing, VANET routing, Algorithm optimization\n"
  },
  "NatWest": {
    "filename": "hridyesh_resume_NatWest.pdf",
    "rawText": "\n\nHridyesh KumarEmail :  hridyesh2309@gmail.com\nGitHub  LinkedIn  LeetCodeMobile :  +91 81302 52611\nExperience\n•LimeroadGurugram\nSoftware Development InternFebruary 2025 - August 2025\n◦Led full software development lifecycle for Vmart storefront integration, working from requirements analysis with\nbusiness analysts through design, coding, testing, and deployment; embedded secure WebView and refactored\nsidebar routing (Kotlin—MVVM), clearing every critical defect using JIRA bug tracking tools.\n◦Engineered a modern ”AddAddress” screen implementing automated testing workflows and Docker containerization\nfor deployment, with granular runtime location-permission handling (Android13 APIs) and Google FusedLocation\nProvider; implemented virtualization techniques for testing environments and cut checkout address-entry time\nthrough performance optimization and scalability best practices.\n◦Developed enterprise-grade Java backend services for payment processing workflows, implementing object-oriented\ndesign patterns with comprehensive testing frameworks (JUnit, Mockito) and CI/CD pipelines using GitLab,\noptimizing database queries for high-performance transaction handling serving 50k+ users.\n•College SetuDelhi\nSoftware Development InternMay 2024 - July 2024\n◦Architected enterprise Data Collection Portal implementing full software dev lifecycle using SQL and Flask;\nmaintained technical documentation in wiki systems and cross-functional teams using Agile methodologies.\n◦Implemented comprehensive testing strategies and debugging workflows,optimizing memory managementand\ntroubleshooting performance bottlenecks while collaborating in agile development environment.\nProjects\n•FurniARAR, Android Development, Firebase\nRepository08/2024 - 08/2024\n◦Modular Architecture:  Implemented clean Android architecture usingKotlin with MVVM pattern and Hilt DI\nframework, creatingopen-source-ready component librariesand technical documentation that improved developer\nonboarding andachieved 30% performance improvementthrough memory management optimization.\n◦Enterprise Architecture:  Implementedmulti-module architecturewith dependency injection across feature modules,\nmanaging component lifecycles while reducing backend response times by 20% through optimized state management and\nunidirectional data flow patterns.\n•Optimized Neural Network-Based Routing Protocol for VANETsVANET, Machine Learning\nRepository08/2024 - 11/2024\n◦Optimization:  Developed a hybrid routing protocol for VANETs integrating Neural Networks and Reinforcement Learning,\nachieving a 20% reduction in latency and a 15% improvement in routing efficiency.\n◦Adaptability:  Designed and implemented a neural network-driven decision-making system to optimize routing in dynamic\nvehicular networks, demonstrating scalability and adaptability through real-time simulations.\nSkills\n•Languages:  Java, Kotlin, Python, JavaScript, TypeScript, SQL, React, React Native, Node.js, HTML, CSS\n•Frameworks and Architecture:  Docker, GitLab CI/CD, Spring Boot, Material Design, Android SDK, MVVM, Clean\nArchitecture, Microservices, RESTful APIs\n•Development Tools:  IntelliJ IDEA, Android Studio, Git, GitHub, AWS, Performance Profiling, Automation Tools,\nVirtualization\nEducation\n•Netaji Subhas University of TechnologyDelhi\nBachelor of Technology in Mathematics and Computing2025\n◦Relevant Coursework:  Data Structures, Design and Analysis of Algorithms, Machine Learning, Software\nEngineering, Soft Computing, Computer Networks, Operating Systems, Scientific Computing, Theory of Automata,\nOptimization, Mathematical Statistics, Database Management System, Computer Architecture, Big Data Analytics\nAchievements\n•Authored a23-page research paperon improving Grover’s algorithm for quantum search optimization, leveraging\nIBM’s Quantum Experience toolset for simulation and testing.  Delivered 3+ on-campus presentations to faculty.\n•Co-authored a13-page journal articleon a hybrid VANET routing protocol using ANN and Reinforcement\nLearning, achieving improved PDR, latency, and throughput through multimetric optimization and simulations.",
    "cleanedData": {
      "education": "Bachelor of Technology in Mathematics and Computing from Netaji Subhas University of Technology (2025)",
      "experience": "Software Development Intern at Limeroad (Feb 2025 - Aug 2025) and College Setu (May 2024 - July 2024)",
      "skills": "Java, Kotlin, React, React Native, Node.js, TypeScript, SQL, JavaScript, HTML, CSS, Material Design, Android SDK, Git, GitHub, Docker",
      "projects": "FurniAR (AR furniture app), Neural Network Routing for VANETs, Email Oasis, Poem Generator, Quantum Computing project",
      "achievements": "Authored 23-page research paper on Grover's algorithm, Co-authored 13-page journal article on VANET routing protocol",
      "fullText": "Hridyesh KumarEmail : hridyesh2309@gmail.com Git Hub Linked In Leet CodeMobile : +91 81302 52611 Experience \n• Limeroad Gurugram Software Development Intern February 2025 - August 2025 \n• Led full software development lifecycle for Vmart storefront integration, working from requirements analysis with business analysts through design, coding, testing, and deployment; embedded secure Web View and refactored sidebar routing (Kotlin—MVVM), clearing every critical defect using JIRA bug tracking tools. \n• Engineered a modern ”Add Address” screen implementing automated testing workflows and Docker containerization for deployment, with granular runtime location-permission handling (Android13 APIs) and Google FusedLocation Provider; implemented virtualization techniques for testing environments and cut checkout address-entry time through performance optimization and scalability best practices. \n• Developed enterprise-grade Java backend services for payment processing workflows, implementing object-oriented design patterns with comprehensive testing frameworks (JUnit, Mockito) and CI/CD pipelines using Git Lab, optimizing database queries for high-performance transaction handling serving 50k+ users. \n• College SetuDelhi Software Development InternMay 2024 - July 2024 \n• Architected enterprise Data Collection Portal implementing full software dev lifecycle using SQL and Flask; maintained technical documentation in wiki systems and cross-functional teams using Agile methodologies. \n• Implemented comprehensive testing strategies and debugging workflows,optimizing memory managementand troubleshooting performance bottlenecks while collaborating in agile development environment. Projects \n• FurniARAR, Android Development, Firebase Repository08/2024 - 08/2024 \n• Modular Architecture: Implemented clean Android architecture usingKotlin with MVVM pattern and Hilt DI framework, creatingopen-source-ready component librariesand technical documentation that improved developer onboarding andachieved 30% performance improvementthrough memory management optimization. \n• Enterprise Architecture: Implementedmulti-module architecturewith dependency injection across feature modules, managing component lifecycles while reducing backend response times by 20% through optimized state management and unidirectional data flow patterns. \n• Optimized Neural Network-Based Routing Protocol for VANETsVANET, Machine Learning Repository08/2024 - 11/2024 \n• Optimization: Developed a hybrid routing protocol for VANETs integrating Neural Networks and Reinforcement Learning, achieving a 20% reduction in latency and a 15% improvement in routing efficiency. \n• Adaptability: Designed and implemented a neural network-driven decision-making system to optimize routing in dynamic vehicular networks, demonstrating scalability and adaptability through real-time simulations. Skills \n• Languages: Java, Kotlin, Python, Java Script, Type Script, SQL, React, React Native, Node.js, HTML, CSS \n• Frameworks and Architecture: Docker, Git Lab CI/CD, Spring Boot, Material Design, Android SDK, MVVM, Clean Architecture, Microservices, RESTful APIs \n• Development Tools: IntelliJ IDEA, Android Studio, Git, Git Hub, AWS, Performance Profiling, Automation Tools, Virtualization Education \n• Netaji Subhas University of Technology Delhi Bachelor of Technology in Mathematics and Computing2025 \n• Relevant Coursework: Data Structures, Design and Analysis of Algorithms, Machine Learning, Software Engineering, Soft Computing, Computer Networks, Operating Systems, Scientific Computing, Theory of Automata, Optimization, Mathematical Statistics, Database Management System, Computer Architecture, Big Data Analytics Achievements \n• Authored a23-page research paperon improving Grover’s algorithm for quantum search optimization, leveraging IBM’s Quantum Experience toolset for simulation and testing. Delivered 3+ on-campus presentations to faculty. \n• Co-authored a13-page journal articleon a hybrid VANET routing protocol using ANN and Reinforcement Learning, achieving improved PDR, latency, and throughput through multimetric optimization and simulations."
    },
    "formattedData": "\nNATWEST RESUME CONTENT:\n\nEDUCATION:\nBachelor of Technology in Mathematics and Computing from Netaji Subhas University of Technology (2025)\n\nEXPERIENCE:\nSoftware Development Intern at Limeroad (Feb 2025 - Aug 2025) and College Setu (May 2024 - July 2024)\n\nSKILLS:\nJava, Kotlin, React, React Native, Node.js, TypeScript, SQL, JavaScript, HTML, CSS, Material Design, Android SDK, Git, GitHub, Docker\n\nPROJECTS:\nFurniAR (AR furniture app), Neural Network Routing for VANETs, Email Oasis, Poem Generator, Quantum Computing project\n\nACHIEVEMENTS:\nAuthored 23-page research paper on Grover's algorithm, Co-authored 13-page journal article on VANET routing protocol\n\nCONTACT INFORMATION:\n- Email: hridyesh2309@gmail.com\n- GitHub: github.com/hridyeshh\n- LinkedIn: linkedin.com/in/hridyeshh\n- LeetCode: leetcode.com/hridyeshh\n- Mobile: +91 81302 52611\n\nKEY METRICS & ACHIEVEMENTS:\n- 95% search accuracy with <50ms response times at Limeroad\n- 50k+ users served with optimized payment processing workflows\n- 30% screen transition speed improvement in FurniAR app\n- 20% backend response time reduction through database optimization\n- 20% latency reduction and 15% efficiency improvement in VANET routing\n- 23-page research paper on quantum computing optimization\n- 13-page journal article on hybrid VANET routing protocol\n- 3+ on-campus presentations to faculty\n\nTECHNICAL EXPERTISE:\n- Mobile Development: Kotlin, Java, Android SDK, Material Design, MVVM, ARCore\n- Web Development: React, React Native, TypeScript, JavaScript, HTML/CSS\n- Backend Development: Node.js, Python, Flask, SQL, RESTful APIs\n- Machine Learning: Neural Networks, Reinforcement Learning, Python\n- Developer Tools: Git, GitHub, Docker, Android Studio, IntelliJ, PyCharm\n- Research: Quantum Computing, VANET routing, Algorithm optimization\n"
  },
  "Amazon": {
    "filename": "hridyesh_resume_amazon.pdf",
    "rawText": "\n\nHridyesh KumarEmail :  hridyesh2309@gmail.com\nGitHub  LinkedIn  Portfolio  LeetCodeMobile :  +91 81302 52611\nExperience\n•LimeroadGurugram\nSoftware Development InternFebruary 2025 - August 2025\n◦Led conception and design of innovative storefront features, building cutting-edge solutions indistributed\ncomputing environmentthat drove fundamental changes in customer shopping experience; created new products\nfrom scratch while managing ambiguity and solving broadly defined problems in fast-paced cycles.\n◦Engineered modern ”AddAddress” screen with automated testing workflows and Docker containerization,\nimplementing granular runtime location-permission handling(Android13 APIs) andGoogle\nFusedLocation Provider; optimized checkout address-entry time through performance optimization and\nvirtualization techniques.\n◦Developed scalable backend services using Java for e-commerce platform,implementing fault-tolerant,low-cost\ndistributed systemsthatenhanced customer shopping experienceacross scalable infrastructure serving\n50k+ users; designed solutions impacting customer satisfaction through high-performance, reliable architecture.\n•College SetuDelhi\nSoftware Development InternMay 2024 - July 2024\n◦Architected enterprise Data Collection Portal implementing fullsoftware dev lifecycle using SQL and Flask;\nmaintained technical documentation in wiki systems and cross-functional teamsusing Agile methodologies.\n◦Collaborated with cross-disciplinary teams including product managers and data scientists to architect scalable data\nplatform using SQL and distributed technologies; delivered high-quality software solutions from broadly defined\nproblems in agile environment with development cycles measured in weeks.\nProjects\n•Distributed Email Analytics PlatformReact, TypeScript, Gmail API, OAuth2\nRepository07/2025 - 07/2025\n◦Scalable Systems:  Builtdistributed email processingintegrating Gmail API with OAuth2 authentication, creating\nfault-tolerant architecturethat processes 100+ emails at scale with efficient API rate limiting forreliable performance\n◦Customer Impact:  Designedcustomer-focused subscription management platformsolving broadly defined email\norganization problems,enhancing user productivity by 80%through automated categorization that directly improves\ncustomer workflow experience.\n•Optimized Neural Network-Based Routing Protocol for VANETsVANET, Machine Learning\nRepository08/2024 - 11/2024\n◦Optimization:  Developed a hybrid routing protocol for VANETs integrating Neural Networks and Reinforcement Learning,\nachieving a 20% reduction in latency and a 15% improvement in routing efficiency.\n◦Adaptability:  Designed and implemented a neural network-driven decision-making system to optimize routing in dynamic\nvehicular networks, demonstrating scalability and adaptability through real-time simulations.\nSkills\n•Programming Languages:  Java, Python, JavaScript, TypeScript, SQL, React, React Native\n•Cloud & Distributed Systems:  AWS, Distributed Storage, Scalable Architecture, Fault-Tolerant Systems, Low-Cost\nOperations, Microservices, Large Distributed Computing, Prediction Systems\n•Technologies & Practices:  RESTful APIs, Database Systems, Performance Engineering, Agile Environment,\nCross-disciplinary Collaboration, Managing Ambiguity, Innovation Development\nEducation\n•Netaji Subhas University of TechnologyDelhi\nBachelor of Technology in Mathematics and Computing2025\n◦Relevant Coursework:  Data Structures, Design and Analysis of Algorithms, Machine Learning, Software\nEngineering, Soft Computing, Computer Networks, Operating Systems, Scientific Computing, Theory of Automata,\nOptimization, Mathematical Statistics, Database Management System, Computer Architecture, Big Data Analytics\nAchievements\n•Authored a23-page research paperon improving Grover’s algorithm for quantum search optimization, leveraging\nIBM’s Quantum Experience toolset for simulation and testing.  Delivered 3+ on-campus presentations to faculty.\n•Co-authored a13-page journal articleon a hybrid VANET routing protocol using ANN and Reinforcement\nLearning, achieving improved PDR, latency, and throughput through multimetric optimization and simulations.",
    "cleanedData": {
      "education": "Bachelor of Technology in Mathematics and Computing from Netaji Subhas University of Technology (2025)",
      "experience": "Software Development Intern at Limeroad (Feb 2025 - Aug 2025) and College Setu (May 2024 - July 2024)",
      "skills": "Java, Kotlin, React, React Native, Node.js, TypeScript, SQL, JavaScript, HTML, CSS, Material Design, Android SDK, Git, GitHub, Docker",
      "projects": "FurniAR (AR furniture app), Neural Network Routing for VANETs, Email Oasis, Poem Generator, Quantum Computing project",
      "achievements": "Authored 23-page research paper on Grover's algorithm, Co-authored 13-page journal article on VANET routing protocol",
      "fullText": "Hridyesh KumarEmail : hridyesh2309@gmail.com Git Hub Linked In Portfolio LeetCode Mobile : +91 81302 52611 Experience \n• Limeroad Gurugram Software Development Intern February 2025 - August 2025 \n• Led conception and design of innovative storefront features, building cutting-edge solutions indistributed computing environmentthat drove fundamental changes in customer shopping experience; created new products from scratch while managing ambiguity and solving broadly defined problems in fast-paced cycles. \n• Engineered modern ”Add Address” screen with automated testing workflows and Docker containerization, implementing granular runtime location-permission handling(Android13 APIs) andGoogle FusedLocation Provider; optimized checkout address-entry time through performance optimization and virtualization techniques. \n• Developed scalable backend services using Java for e-commerce platform,implementing fault-tolerant,low-cost distributed systemsthatenhanced customer shopping experienceacross scalable infrastructure serving 50k+ users; designed solutions impacting customer satisfaction through high-performance, reliable architecture. \n• College SetuDelhi Software Development InternMay 2024 - July 2024 \n• Architected enterprise Data Collection Portal implementing fullsoftware dev lifecycle using SQL and Flask; maintained technical documentation in wiki systems and cross-functional teamsusing Agile methodologies. \n• Collaborated with cross-disciplinary teams including product managers and data scientists to architect scalable data platform using SQL and distributed technologies; delivered high-quality software solutions from broadly defined problems in agile environment with development cycles measured in weeks. Projects \n• Distributed Email Analytics PlatformReact, Type Script, Gmail API, OAuth2 Repository07/2025 - 07/2025 \n• Scalable Systems: Builtdistributed email processingintegrating Gmail API with OAuth2 authentication, creating fault-tolerant architecturethat processes 100+ emails at scale with efficient API rate limiting forreliable performance \n• Customer Impact: Designedcustomer-focused subscription management platformsolving broadly defined email organization problems,enhancing user productivity by 80%through automated categorization that directly improves customer workflow experience. \n• Optimized Neural Network-Based Routing Protocol for VANETsVANET, Machine Learning Repository08/2024 - 11/2024 \n• Optimization: Developed a hybrid routing protocol for VANETs integrating Neural Networks and Reinforcement Learning, achieving a 20% reduction in latency and a 15% improvement in routing efficiency. \n• Adaptability: Designed and implemented a neural network-driven decision-making system to optimize routing in dynamic vehicular networks, demonstrating scalability and adaptability through real-time simulations. Skills \n• Programming Languages: Java, Python, Java Script, Type Script, SQL, React, React Native \n• Cloud & Distributed Systems: AWS, Distributed Storage, Scalable Architecture, Fault-Tolerant Systems, Low-Cost Operations, Microservices, Large Distributed Computing, Prediction Systems \n• Technologies & Practices: RESTful APIs, Database Systems, Performance Engineering, Agile Environment, Cross-disciplinary Collaboration, Managing Ambiguity, Innovation Development Education \n• Netaji Subhas University of Technology Delhi Bachelor of Technology in Mathematics and Computing2025 \n• Relevant Coursework: Data Structures, Design and Analysis of Algorithms, Machine Learning, Software Engineering, Soft Computing, Computer Networks, Operating Systems, Scientific Computing, Theory of Automata, Optimization, Mathematical Statistics, Database Management System, Computer Architecture, Big Data Analytics Achievements \n• Authored a23-page research paperon improving Grover’s algorithm for quantum search optimization, leveraging IBM’s Quantum Experience toolset for simulation and testing. Delivered 3+ on-campus presentations to faculty. \n• Co-authored a13-page journal articleon a hybrid VANET routing protocol using ANN and Reinforcement Learning, achieving improved PDR, latency, and throughput through multimetric optimization and simulations."
    },
    "formattedData": "\nAMAZON RESUME CONTENT:\n\nEDUCATION:\nBachelor of Technology in Mathematics and Computing from Netaji Subhas University of Technology (2025)\n\nEXPERIENCE:\nSoftware Development Intern at Limeroad (Feb 2025 - Aug 2025) and College Setu (May 2024 - July 2024)\n\nSKILLS:\nJava, Kotlin, React, React Native, Node.js, TypeScript, SQL, JavaScript, HTML, CSS, Material Design, Android SDK, Git, GitHub, Docker\n\nPROJECTS:\nFurniAR (AR furniture app), Neural Network Routing for VANETs, Email Oasis, Poem Generator, Quantum Computing project\n\nACHIEVEMENTS:\nAuthored 23-page research paper on Grover's algorithm, Co-authored 13-page journal article on VANET routing protocol\n\nCONTACT INFORMATION:\n- Email: hridyesh2309@gmail.com\n- GitHub: github.com/hridyeshh\n- LinkedIn: linkedin.com/in/hridyeshh\n- LeetCode: leetcode.com/hridyeshh\n- Mobile: +91 81302 52611\n\nKEY METRICS & ACHIEVEMENTS:\n- 95% search accuracy with <50ms response times at Limeroad\n- 50k+ users served with optimized payment processing workflows\n- 30% screen transition speed improvement in FurniAR app\n- 20% backend response time reduction through database optimization\n- 20% latency reduction and 15% efficiency improvement in VANET routing\n- 23-page research paper on quantum computing optimization\n- 13-page journal article on hybrid VANET routing protocol\n- 3+ on-campus presentations to faculty\n\nTECHNICAL EXPERTISE:\n- Mobile Development: Kotlin, Java, Android SDK, Material Design, MVVM, ARCore\n- Web Development: React, React Native, TypeScript, JavaScript, HTML/CSS\n- Backend Development: Node.js, Python, Flask, SQL, RESTful APIs\n- Machine Learning: Neural Networks, Reinforcement Learning, Python\n- Developer Tools: Git, GitHub, Docker, Android Studio, IntelliJ, PyCharm\n- Research: Quantum Computing, VANET routing, Algorithm optimization\n"
  },
  "Oracle": {
    "filename": "hridyesh_resume_oracle.pdf",
    "rawText": "\n\nHridyesh KumarEmail :  hridyesh2309@gmail.com\nGitHub  LinkedIn  LeetCodeMobile :  +91 81302 52611\nExperience\n•LimeroadGurugram\nSoftware Development InternFebruary 2025 - August 2025\n◦Integrated Vmart storefrontinto the app’s navigation drawer by embedding a secure WebView and refactoring\nsidebar routing (Kotlin—MVVM); identified and cleared every critical defect in the release backlog.\n◦Eliminating crashes in QA and enabling a friction-free purchase flow for more than 50k monthly active users.\n◦Engineered a modern “AddAddress” screen from scratch with Material3, implementing granular runtime\nlocation-permission handling(Android13 APIs) and Google FusedLocation Provider; cut checkout address-entry\ntime and user drop-offs, while boosting Lighthouse accessibility and performance scores.\n◦Developed an advanced fuzzy search system implementingLevenshtein distance, Jaro-Winkler similarity, and\nSoundex phoneticmatching algorithms (TypeScript); achieved95%search accuracy with ¡50ms response time,\nsignificantly reducing payment friction and user drop-offs during checkout.\n◦Architected a comprehensive coupon management system using React Native with TypeScript,implementing\nticket-style UI componentswith perforated edge design and real-time toast notifications; reduced coupon\napplication time by80%(from 45s to less than 10s) and improved conversion rates for promotional offers.\n•College SetuDelhi\nSoftware Development InternMay 2024 - July 2024\n◦Revamped the company’s website using ReactJS and Tailwind CSS and developed a Data Collection Portal with\nFlask, enhancing functionality and user experience.\n◦Demonstrated strong teamwork, adaptability, and a commitment to delivering high-quality outcomes in a fast-paced\ndevelopment environment.\nProjects\n•FurniARAR, Android Development, Firebase\nRepository08/2024 - 08/2024\n◦Responsiveness:  Developed an AR-based furniture visualization app usingKotlin, Sceneform (ARCore), MVVM, and\nHilt, enhanced user experience by optimizing screen transition speed by 30%\n◦Efficiency:  Optimized Firebase rules, reducing backend response times by 20%, and integratedFirebase Auth, Firestore,\nStorage, Glide, and View Binding for efficient, scalable data handling\n•Optimized Neural Network-Based Routing Protocol for VANETsVANET, Machine Learning\nRepository08/2024 - 11/2024\n◦Optimization:  Developed a hybrid routing protocol for VANETs integrating Neural Networks and Reinforcement Learning,\nachieving a 20% reduction in latency and a 15% improvement in routing efficiency.\n◦Adaptability:  Designed and implemented a neural network-driven decision-making system to optimize routing in dynamic\nvehicular networks, demonstrating scalability and adaptability through real-time simulations.\nSkills\n•Languages and Development tools:  Java, Kotlin, React, React Native, Node.js, TypeScript, SQL, JavaScript,\nHTML, CSS\n•Frameworks:  Material Design, Android SDK, OkHttp, Gson Arch-components, Tailwind CSS, React Hooks\n•Developer Tools:  Git, GitHub, Docker, PyCharm, Jupyter Notebook, IntelliJ, Android Studio, Cursor, AI prompts\nEducation\n•Netaji Subhas University of TechnologyDelhi\nBachelor of Technology in Mathematics and Computing2025\n◦Relevant Coursework:  Data Structures, Design and Analysis of Algorithms, Machine Learning, Software\nEngineering, Soft Computing, Computer Networks, Operating Systems, Scientific Computing, Theory of Automata,\nOptimization, Mathematical Statistics, Database Management System, Computer Architecture, Big Data Analytics\nAchievements\n•Authored a23-page research paperon improving Grover’s algorithm for quantum search optimization, leveraging\nIBM’s Quantum Experience toolset for simulation and testing.  Delivered 3+ on-campus presentations to faculty.\n•Co-authored a13-page journal articleon a hybrid VANET routing protocol using ANN and Reinforcement\nLearning, achieving improved PDR, latency, and throughput through multimetric optimization and simulations.",
    "cleanedData": {
      "education": "Bachelor of Technology in Mathematics and Computing from Netaji Subhas University of Technology (2025)",
      "experience": "Software Development Intern at Limeroad (Feb 2025 - Aug 2025) and College Setu (May 2024 - July 2024)",
      "skills": "Java, Kotlin, React, React Native, Node.js, TypeScript, SQL, JavaScript, HTML, CSS, Material Design, Android SDK, Git, GitHub, Docker",
      "projects": "FurniAR (AR furniture app), Neural Network Routing for VANETs, Email Oasis, Poem Generator, Quantum Computing project",
      "achievements": "Authored 23-page research paper on Grover's algorithm, Co-authored 13-page journal article on VANET routing protocol",
      "fullText": "Hridyesh KumarEmail : hridyesh2309@gmail.com Git Hub Linked In Leet CodeMobile : +91 81302 52611 Experience \n• Limeroad Gurugram Software Development Intern February 2025 - August 2025 \n• Integrated Vmart storefrontinto the app’s navigation drawer by embedding a secure Web View and refactoring sidebar routing (Kotlin—MVVM); identified and cleared every critical defect in the release backlog. \n• Eliminating crashes in QA and enabling a friction-free purchase flow for more than 50k monthly active users. \n• Engineered a modern “Add Address” screen from scratch with Material3, implementing granular runtime location-permission handling(Android13 APIs) and Google FusedLocation Provider; cut checkout address-entry time and user drop-offs, while boosting Lighthouse accessibility and performance scores. \n• Developed an advanced fuzzy search system implementingLevenshtein distance, Jaro-Winkler similarity, and Soundex phoneticmatching algorithms (Type Script); achieved95%search accuracy with ¡50ms response time, significantly reducing payment friction and user drop-offs during checkout. \n• Architected a comprehensive coupon management system using React Native with Type Script,implementing ticket-style UI componentswith perforated edge design and real-time toast notifications; reduced coupon application time by80%(from 45s to less than 10s) and improved conversion rates for promotional offers. \n• College SetuDelhi Software Development InternMay 2024 - July 2024 \n• Revamped the company’s website using ReactJS and Tailwind CSS and developed a Data Collection Portal with Flask, enhancing functionality and user experience. \n• Demonstrated strong teamwork, adaptability, and a commitment to delivering high-quality outcomes in a fast-paced development environment. Projects \n• FurniARAR, Android Development, Firebase Repository08/2024 - 08/2024 \n• Responsiveness: Developed an AR-based furniture visualization app usingKotlin, Sceneform (ARCore), MVVM, and Hilt, enhanced user experience by optimizing screen transition speed by 30% \n• Efficiency: Optimized Firebase rules, reducing backend response times by 20%, and integratedFirebase Auth, Firestore, Storage, Glide, and View Binding for efficient, scalable data handling \n• Optimized Neural Network-Based Routing Protocol for VANETsVANET, Machine Learning Repository08/2024 - 11/2024 \n• Optimization: Developed a hybrid routing protocol for VANETs integrating Neural Networks and Reinforcement Learning, achieving a 20% reduction in latency and a 15% improvement in routing efficiency. \n• Adaptability: Designed and implemented a neural network-driven decision-making system to optimize routing in dynamic vehicular networks, demonstrating scalability and adaptability through real-time simulations. Skills \n• Languages and Development tools: Java, Kotlin, React, React Native, Node.js, Type Script, SQL, Java Script, HTML, CSS \n• Frameworks: Material Design, Android SDK, Ok Http, Gson Arch-components, Tailwind CSS, React Hooks \n• Developer Tools: Git, Git Hub, Docker, Py Charm, Jupyter Notebook, IntelliJ, Android Studio, Cursor, AI prompts Education \n• Netaji Subhas University of Technology Delhi Bachelor of Technology in Mathematics and Computing2025 \n• Relevant Coursework: Data Structures, Design and Analysis of Algorithms, Machine Learning, Software Engineering, Soft Computing, Computer Networks, Operating Systems, Scientific Computing, Theory of Automata, Optimization, Mathematical Statistics, Database Management System, Computer Architecture, Big Data Analytics Achievements \n• Authored a23-page research paperon improving Grover’s algorithm for quantum search optimization, leveraging IBM’s Quantum Experience toolset for simulation and testing. Delivered 3+ on-campus presentations to faculty. \n• Co-authored a13-page journal articleon a hybrid VANET routing protocol using ANN and Reinforcement Learning, achieving improved PDR, latency, and throughput through multimetric optimization and simulations."
    },
    "formattedData": "\nORACLE RESUME CONTENT:\n\nEDUCATION:\nBachelor of Technology in Mathematics and Computing from Netaji Subhas University of Technology (2025)\n\nEXPERIENCE:\nSoftware Development Intern at Limeroad (Feb 2025 - Aug 2025) and College Setu (May 2024 - July 2024)\n\nSKILLS:\nJava, Kotlin, React, React Native, Node.js, TypeScript, SQL, JavaScript, HTML, CSS, Material Design, Android SDK, Git, GitHub, Docker\n\nPROJECTS:\nFurniAR (AR furniture app), Neural Network Routing for VANETs, Email Oasis, Poem Generator, Quantum Computing project\n\nACHIEVEMENTS:\nAuthored 23-page research paper on Grover's algorithm, Co-authored 13-page journal article on VANET routing protocol\n\nCONTACT INFORMATION:\n- Email: hridyesh2309@gmail.com\n- GitHub: github.com/hridyeshh\n- LinkedIn: linkedin.com/in/hridyeshh\n- LeetCode: leetcode.com/hridyeshh\n- Mobile: +91 81302 52611\n\nKEY METRICS & ACHIEVEMENTS:\n- 95% search accuracy with <50ms response times at Limeroad\n- 50k+ users served with optimized payment processing workflows\n- 30% screen transition speed improvement in FurniAR app\n- 20% backend response time reduction through database optimization\n- 20% latency reduction and 15% efficiency improvement in VANET routing\n- 23-page research paper on quantum computing optimization\n- 13-page journal article on hybrid VANET routing protocol\n- 3+ on-campus presentations to faculty\n\nTECHNICAL EXPERTISE:\n- Mobile Development: Kotlin, Java, Android SDK, Material Design, MVVM, ARCore\n- Web Development: React, React Native, TypeScript, JavaScript, HTML/CSS\n- Backend Development: Node.js, Python, Flask, SQL, RESTful APIs\n- Machine Learning: Neural Networks, Reinforcement Learning, Python\n- Developer Tools: Git, GitHub, Docker, Android Studio, IntelliJ, PyCharm\n- Research: Quantum Computing, VANET routing, Algorithm optimization\n"
  },
  "Recro": {
    "filename": "hridyesh_resume_recro.pdf",
    "rawText": "\n\nHridyesh KumarEmail :  hridyesh2309@gmail.com\nGitHub  LinkedIn  LeetCodeMobile :  +91 81302 52611\nExperience\n•LimeroadGurugram\nSoftware Development InternFebruary 2025 - August 2025\n◦Integrated Vmart storefrontinto the app’s navigation drawer by embedding a secure WebView and refactoring\nsidebar routing (Kotlin—MVVM); identified and cleared every critical defect in the release backlog.\n◦Eliminating crashes in QA and enabling a friction-free purchase flow for more than 50k monthly active users.\n◦Engineered a modern “AddAddress” screen from scratch with Material3, implementing granular runtime\nlocation-permission handling(Android13 APIs) and Google FusedLocation Provider; cut checkout address-entry\ntime and user drop-offs, while boosting Lighthouse accessibility and performance scores.\n◦Developed an advanced fuzzy search system implementingLevenshtein distance, Jaro-Winkler similarity, and\nSoundex phoneticmatching algorithms (TypeScript); achieved95%search accuracy with ¡50ms response time,\nsignificantly reducing payment friction and user drop-offs during checkout.\n◦Architected a comprehensive coupon management system using React Native with TypeScript,implementing\nticket-style UI componentswith perforated edge design and real-time toast notifications; reduced coupon\napplication time by80%(from 45s to less than 10s) and improved conversion rates for promotional offers.\n•College SetuDelhi\nSoftware Development InternMay 2024 - July 2024\n◦Revamped the company’s website using ReactJS and Tailwind CSS and developed a Data Collection Portal with\nFlask, enhancing functionality and user experience.\n◦Demonstrated strong teamwork, adaptability, and a commitment to delivering high-quality outcomes in a fast-paced\ndevelopment environment.\nProjects\n•FurniARAR, Android Development, Firebase\nRepository08/2024 - 08/2024\n◦Responsiveness:  Developed an AR-based furniture visualization app usingKotlin, Sceneform (ARCore), MVVM, and\nHilt, enhanced user experience by optimizing screen transition speed by 30%\n◦Efficiency:  Optimized Firebase rules, reducing backend response times by 20%, and integratedFirebase Auth, Firestore,\nStorage, Glide, and View Binding for efficient, scalable data handling\n•Optimized Neural Network-Based Routing Protocol for VANETsVANET, Machine Learning\nRepository08/2024 - 11/2024\n◦Optimization:  Developed a hybrid routing protocol for VANETs integrating Neural Networks and Reinforcement Learning,\nachieving a 20% reduction in latency and a 15% improvement in routing efficiency.\n◦Adaptability:  Designed and implemented a neural network-driven decision-making system to optimize routing in dynamic\nvehicular networks, demonstrating scalability and adaptability through real-time simulations.\nSkills\n•Languages and Development tools:  Java, Kotlin, React, React Native, Node.js, TypeScript, SQL, JavaScript,\nHTML, CSS\n•Frameworks:  Material Design, Android SDK, OkHttp, Gson Arch-components, Tailwind CSS, React Hooks\n•Developer Tools:  Git, GitHub, Docker, PyCharm, Jupyter Notebook, IntelliJ, Android Studio, Cursor, AI prompts\nEducation\n•Netaji Subhas University of TechnologyDelhi\nBachelor of Technology in Mathematics and Computing2025\n◦Relevant Coursework:  Data Structures, Design and Analysis of Algorithms, Machine Learning, Software\nEngineering, Soft Computing, Computer Networks, Operating Systems, Scientific Computing, Theory of Automata,\nOptimization, Mathematical Statistics, Database Management System, Computer Architecture, Big Data Analytics\nAchievements\n•Authored a23-page research paperon improving Grover’s algorithm for quantum search optimization, leveraging\nIBM’s Quantum Experience toolset for simulation and testing.  Delivered 3+ on-campus presentations to faculty.\n•Co-authored a13-page journal articleon a hybrid VANET routing protocol using ANN and Reinforcement\nLearning, achieving improved PDR, latency, and throughput through multimetric optimization and simulations.",
    "cleanedData": {
      "education": "Bachelor of Technology in Mathematics and Computing from Netaji Subhas University of Technology (2025)",
      "experience": "Software Development Intern at Limeroad (Feb 2025 - Aug 2025) and College Setu (May 2024 - July 2024)",
      "skills": "Java, Kotlin, React, React Native, Node.js, TypeScript, SQL, JavaScript, HTML, CSS, Material Design, Android SDK, Git, GitHub, Docker",
      "projects": "FurniAR (AR furniture app), Neural Network Routing for VANETs, Email Oasis, Poem Generator, Quantum Computing project",
      "achievements": "Authored 23-page research paper on Grover's algorithm, Co-authored 13-page journal article on VANET routing protocol",
      "fullText": "Hridyesh KumarEmail : hridyesh2309@gmail.com Git Hub Linked In Leet CodeMobile : +91 81302 52611 Experience \n• Limeroad Gurugram Software Development Intern February 2025 - August 2025 \n• Integrated Vmart storefrontinto the app’s navigation drawer by embedding a secure Web View and refactoring sidebar routing (Kotlin—MVVM); identified and cleared every critical defect in the release backlog. \n• Eliminating crashes in QA and enabling a friction-free purchase flow for more than 50k monthly active users. \n• Engineered a modern “Add Address” screen from scratch with Material3, implementing granular runtime location-permission handling(Android13 APIs) and Google FusedLocation Provider; cut checkout address-entry time and user drop-offs, while boosting Lighthouse accessibility and performance scores. \n• Developed an advanced fuzzy search system implementingLevenshtein distance, Jaro-Winkler similarity, and Soundex phoneticmatching algorithms (Type Script); achieved95%search accuracy with ¡50ms response time, significantly reducing payment friction and user drop-offs during checkout. \n• Architected a comprehensive coupon management system using React Native with Type Script,implementing ticket-style UI componentswith perforated edge design and real-time toast notifications; reduced coupon application time by80%(from 45s to less than 10s) and improved conversion rates for promotional offers. \n• College SetuDelhi Software Development InternMay 2024 - July 2024 \n• Revamped the company’s website using ReactJS and Tailwind CSS and developed a Data Collection Portal with Flask, enhancing functionality and user experience. \n• Demonstrated strong teamwork, adaptability, and a commitment to delivering high-quality outcomes in a fast-paced development environment. Projects \n• FurniARAR, Android Development, Firebase Repository08/2024 - 08/2024 \n• Responsiveness: Developed an AR-based furniture visualization app usingKotlin, Sceneform (ARCore), MVVM, and Hilt, enhanced user experience by optimizing screen transition speed by 30% \n• Efficiency: Optimized Firebase rules, reducing backend response times by 20%, and integratedFirebase Auth, Firestore, Storage, Glide, and View Binding for efficient, scalable data handling \n• Optimized Neural Network-Based Routing Protocol for VANETsVANET, Machine Learning Repository08/2024 - 11/2024 \n• Optimization: Developed a hybrid routing protocol for VANETs integrating Neural Networks and Reinforcement Learning, achieving a 20% reduction in latency and a 15% improvement in routing efficiency. \n• Adaptability: Designed and implemented a neural network-driven decision-making system to optimize routing in dynamic vehicular networks, demonstrating scalability and adaptability through real-time simulations. Skills \n• Languages and Development tools: Java, Kotlin, React, React Native, Node.js, Type Script, SQL, Java Script, HTML, CSS \n• Frameworks: Material Design, Android SDK, Ok Http, Gson Arch-components, Tailwind CSS, React Hooks \n• Developer Tools: Git, Git Hub, Docker, Py Charm, Jupyter Notebook, IntelliJ, Android Studio, Cursor, AI prompts Education \n• Netaji Subhas University of Technology Delhi Bachelor of Technology in Mathematics and Computing2025 \n• Relevant Coursework: Data Structures, Design and Analysis of Algorithms, Machine Learning, Software Engineering, Soft Computing, Computer Networks, Operating Systems, Scientific Computing, Theory of Automata, Optimization, Mathematical Statistics, Database Management System, Computer Architecture, Big Data Analytics Achievements \n• Authored a23-page research paperon improving Grover’s algorithm for quantum search optimization, leveraging IBM’s Quantum Experience toolset for simulation and testing. Delivered 3+ on-campus presentations to faculty. \n• Co-authored a13-page journal articleon a hybrid VANET routing protocol using ANN and Reinforcement Learning, achieving improved PDR, latency, and throughput through multimetric optimization and simulations."
    },
    "formattedData": "\nRECRO RESUME CONTENT:\n\nEDUCATION:\nBachelor of Technology in Mathematics and Computing from Netaji Subhas University of Technology (2025)\n\nEXPERIENCE:\nSoftware Development Intern at Limeroad (Feb 2025 - Aug 2025) and College Setu (May 2024 - July 2024)\n\nSKILLS:\nJava, Kotlin, React, React Native, Node.js, TypeScript, SQL, JavaScript, HTML, CSS, Material Design, Android SDK, Git, GitHub, Docker\n\nPROJECTS:\nFurniAR (AR furniture app), Neural Network Routing for VANETs, Email Oasis, Poem Generator, Quantum Computing project\n\nACHIEVEMENTS:\nAuthored 23-page research paper on Grover's algorithm, Co-authored 13-page journal article on VANET routing protocol\n\nCONTACT INFORMATION:\n- Email: hridyesh2309@gmail.com\n- GitHub: github.com/hridyeshh\n- LinkedIn: linkedin.com/in/hridyeshh\n- LeetCode: leetcode.com/hridyeshh\n- Mobile: +91 81302 52611\n\nKEY METRICS & ACHIEVEMENTS:\n- 95% search accuracy with <50ms response times at Limeroad\n- 50k+ users served with optimized payment processing workflows\n- 30% screen transition speed improvement in FurniAR app\n- 20% backend response time reduction through database optimization\n- 20% latency reduction and 15% efficiency improvement in VANET routing\n- 23-page research paper on quantum computing optimization\n- 13-page journal article on hybrid VANET routing protocol\n- 3+ on-campus presentations to faculty\n\nTECHNICAL EXPERTISE:\n- Mobile Development: Kotlin, Java, Android SDK, Material Design, MVVM, ARCore\n- Web Development: React, React Native, TypeScript, JavaScript, HTML/CSS\n- Backend Development: Node.js, Python, Flask, SQL, RESTful APIs\n- Machine Learning: Neural Networks, Reinforcement Learning, Python\n- Developer Tools: Git, GitHub, Docker, Android Studio, IntelliJ, PyCharm\n- Research: Quantum Computing, VANET routing, Algorithm optimization\n"
  }
}